jwy8612/monitor/software/header/_iom32to64M1v.h
/* Status REGister */
#define SREG	(*(volatile unsigned char *)0x5F)

/* Watchdog Timer Control Register */
#define WDTCSR	(*(volatile unsigned char *)0x60)
#define  WDIF     7
#define  WDIE     6
#define  WDP3     5
#define  WDCE     4
#define  WDE      3
#define  WDP2     2
#define  WDP1     1
#define  WDP0     0

/* Oscillator */
#define CLKPR	(*(volatile unsigned char *)0x61)
#define  CLKPCE   7
#define  CLKPS3   3
#define  CLKPS2   2
#define  CLKPS1   1
#define  CLKPS0   0
#define OSCCAL	(*(volatile unsigned char *)0x66)

/* Power Reduction Register */
#define PRR 	(*(volatile unsigned char *)0x64)
#define  PRCAN    6
#define  PRPSC    5
#define  PRTIM1   4
#define  PRTIM0   3
#define  PRSPI    2
#define  PRLIN    1
#define  PRADC    0

/* Analog Amplifier */
#define AMP0CSR	(*(volatile unsigned int *)0x75)
#define  AMP0EN   7
#define  AMP0IS   6
#define  AMP0G1   5
#define  AMP0G0   4
#define  AMPCMP0  3
#define  AMP0TS2  2
#define  AMP0TS1  1
#define  AMP0TS0  0
#define AMP1CSR	(*(volatile unsigned int *)0x76)
#define  AMP1EN   7
#define  AMP1IS   6
#define  AMP1G1   5
#define  AMP1G0   4
#define  AMPCMP1  3
#define  AMP1TS2  2
#define  AMP1TS1  1
#define  AMP1TS0  0
#define AMP2CSR	(*(volatile unsigned int *)0x77)
#define  AMP2EN   7
#define  AMP2IS   6
#define  AMP2G1   5
#define  AMP2G0   4
#define  AMPCMP2  3
#define  AMP2TS2  2
#define  AMP2TS1  1
#define  AMP2TS0  0

/* Analog Digital Converter */
#define ADC 	(*(volatile unsigned int *)0x78)
#define ADCL	(*(volatile unsigned char *)0x78)
#define ADCH	(*(volatile unsigned char *)0x79)
#define ADCSRA	(*(volatile unsigned char *)0x7a)
#define  ADEN     7
#define  ADSC     6
#define  ADATE    5
#define  ADFR     5
#define  ADIF     4
#define  ADIE     3
#define  ADPS2    2
#define  ADPS1    1
#define  ADPS0    0
#define ADCSRB	(*(volatile unsigned char *)0x7b)
#define  ADHSM    7
#define  ISRCEN   6
#define  AREFEN   5
#define  ADTS3    3
#define  ADTS2    2
#define  ADTS1    1
#define  ADTS0    0
#define ADMUX	(*(volatile unsigned char *)0x7c)
#define  REFS1    7
#define  REFS0    6
#define  ADLAR    5
#define  MUX3     3
#define  MUX2     2
#define  MUX1     1
#define  MUX0     0

#define DIDR1	(*(volatile unsigned char *)0x7f)
#define  AMP2PD   6
#define  ACMP0D   5
#define  AMP0PD   4
#define  AMP0ND   3
#define  ACMP1D   2
#define  ADC10D   2
#define  ACMP3D   1
#define  AMP1PD   1
#define  ADC9D    1
#define  AMP1ND   0
#define  ADC8D    0
#define DIDR0	(*(volatile unsigned char *)0x7e)
#define  ADC7D    7
#define  ACMPN1D  6
#define  AMP2ND   6
#define  ADC6D    6
#define  ACMPN0D  5
#define  ADC5D    5
#define  ADC4D    4
#define  ACMPN2D  3
#define  ADC3D    3
#define  ACMP2D   2
#define  ADC2D    2
#define  ADC1D    1
#define  ACMPN3D  0
#define  ADC0D    0

/* DAC */
#define DACON	(*(volatile unsigned char *)0x90)
#define  DAATE    7
#define  DATS2    6
#define  DATS1    5
#define  DATS0    4
#define  DALA     2
#define  DAOE     1
#define  DAEN     0
#define DAC 	(*(volatile unsigned int *)0x91)
#define DACL	(*(volatile unsigned char *)0x91)
#define DACH	(*(volatile unsigned char *)0x92)

/* Analog Comparator */
#define AC0CON	(*(volatile unsigned char *)0x94)
#define  AC0EN    7
#define  AC0IE    6
#define  AC0IS1   5
#define  AC0IS0   4
#define  ACCKSEL  3
#define  AC0M2    2
#define  AC0M1    1
#define  AC0M0    0
#define AC1CON	(*(volatile unsigned char *)0x95)
#define  AC1EN    7
#define  AC1IE    6
#define  AC1IS1   5
#define  AC1IS0   4
#define  AC1ICE   3
#define  AC1M2    2
#define  AC1M1    1
#define  AC1M0    0
#define AC2CON	(*(volatile unsigned char *)0x96)
#define  AC2EN    7
#define  AC2IE    6
#define  AC2IS1   5
#define  AC2IS0   4
#define  AC2M2    2
#define  AC2M1    1
#define  AC2M0    0
#define AC3CON	(*(volatile unsigned char *)0x97)
#define  AC3EN    7
#define  AC3IE    6
#define  AC3IS1   5
#define  AC3IS0   4
#define  AC3M2    2
#define  AC3M1    1
#define  AC3M0    0

/* Timer/Counter Interrupts */
#define TIMSK0	(*(volatile unsigned char *)0x6e)
#define  OCIE0B   1
#define  OCIE0A   0
#define  TOIE0    0
#define TIMSK1	(*(volatile unsigned char *)0x6f)
#define  TICIE1   5
#define  ICIE1    5
#define  OCIE1B   2
#define  OCIE1A   1
#define  TOIE1    0

/* Timer/Counter 1 */
#define TCCR1A	(*(volatile unsigned char *)0x80)
#define  COM1A1   7
#define  COM1A0   6
#define  COM1B1   5
#define  COM1B0   4
#define  WGM11    1
#define  WGM10    0
#define TCCR1B	(*(volatile unsigned char *)0x81)
#define  ICNC1    7
#define  ICES1    6
#define  WGM13    4
#define  WGM12    3
#define  CS12     2
#define  CS11     1
#define  CS10     0
#define TCCR1C	(*(volatile unsigned char *)0x82)
#define  FOC1A    7
#define  FOC1B    6
#define TCNT1	(*(volatile unsigned int *)0x84)
#define TCNT1L	(*(volatile unsigned char *)0x84)
#define TCNT1H	(*(volatile unsigned char *)0x85)
#define ICR1	(*(volatile unsigned int *)0x86)
#define ICR1L	(*(volatile unsigned char *)0x86)
#define ICR1H	(*(volatile unsigned char *)0x87)
#define OCR1A	(*(volatile unsigned int *)0x88)
#define OCR1AL	(*(volatile unsigned char *)0x88)
#define OCR1AH	(*(volatile unsigned char *)0x89)
#define OCR1B	(*(volatile unsigned int *)0x8a)
#define OCR1BL	(*(volatile unsigned char *)0x8a)
#define OCR1BH	(*(volatile unsigned char *)0x8b)


/* PSC registers */
#define POCR0SA	(*(volatile unsigned int *)0xa0)
#define POCR0SAL	(*(volatile unsigned char *)0xa0)
#define POCR0SAH	(*(volatile unsigned char *)0xa1)
#define POCR0RA	(*(volatile unsigned int *)0xa2)
#define POCR0RAL	(*(volatile unsigned char *)0xa2)
#define POCR0RAH	(*(volatile unsigned char *)0xa3)
#define POCR0SB	(*(volatile unsigned int *)0xa4)
#define POCR0SBL	(*(volatile unsigned char *)0xa4)
#define POCR0SBH	(*(volatile unsigned char *)0xa5)
#define POCR1SA	(*(volatile unsigned int *)0xa6)
#define POCR1SAL	(*(volatile unsigned char *)0xa6)
#define POCR1SAH	(*(volatile unsigned char *)0xa7)
#define POCR1RA	(*(volatile unsigned int *)0xa8)
#define POCR1RAL	(*(volatile unsigned char *)0xa8)
#define POCR1RAH	(*(volatile unsigned char *)0xa9)
#define POCR1SB	(*(volatile unsigned int *)0xaa)
#define POCR1SBL	(*(volatile unsigned char *)0xaa)
#define POCR1SBH	(*(volatile unsigned char *)0xab)
#define POCR2SA	(*(volatile unsigned int *)0xac)
#define POCR2SAL	(*(volatile unsigned char *)0xac)
#define POCR2SAH	(*(volatile unsigned char *)0xad)
#define POCR2RA	(*(volatile unsigned int *)0xae)
#define POCR2RAL	(*(volatile unsigned char *)0xae)
#define POCR2RAH	(*(volatile unsigned char *)0xaf)
#define POCR2SB	(*(volatile unsigned int *)0xb0)
#define POCR2SBL	(*(volatile unsigned char *)0xb0)
#define POCR2SBH	(*(volatile unsigned char *)0xb1)
#define POCR_RB	(*(volatile unsigned int *)0xb2)
#define POCR_RBL	(*(volatile unsigned char *)0xb2)
#define POCR_RBH	(*(volatile unsigned char *)0xb3)
#define PSYNC	(*(volatile unsigned int *)0xb2)
#define  PSYNC21  5
#define  PSYNC20  4
#define  PSYNC11  3
#define  PSYNC10  2
#define  PSYNC01  1
#define  PSYNC00  0
#define PCNF	(*(volatile unsigned int *)0xb2)
#define  PULOCK1  5
#define  PMODE    4
#define  POPB     3
#define  POPA     2
#define POC 	(*(volatile unsigned int *)0xb2)
#define  POEN2B   1
#define  POEN2A   0
#define  POEN1B   1
#define  POEN1A   0
#define  POEN0B   1
#define  POEN0A   0
#define PCTL	(*(volatile unsigned int *)0xb2)
#define  PPRE1    7
#define  PPRE0    6
#define  PCLKSEL  5
#define  PCCYC    1
#define  PRUN     0
#define PMIC0	(*(volatile unsigned int *)0xb2)
#define  POVEN0   7
#define  PISEL0   6
#define  PELEV0   5
#define  PFLTE0   4
#define  PAOC0    3
#define  PRFM02   2
#define  PRFM01   1
#define  PRFM00   0
#define PMIC1	(*(volatile unsigned int *)0xb2)
#define  POVEN1   7
#define  PISEL1   6
#define  PELEV1   5
#define  PFLTE1   4
#define  PAOC1    3
#define  PRFM12   2
#define  PRFM11   1
#define  PRFM10   0
#define PMIC2	(*(volatile unsigned int *)0xb2)
#define  POVEN2   7
#define  PISEL2   6
#define  PELEV2   5
#define  PFLTE2   4
#define  PAOC2    3
#define  PRFM22   2
#define  PRFM21   1
#define  PRFM20   0
#define PIM 	(*(volatile unsigned int *)0xb2)
#define  PEVE2    3
#define  PEVE1    2
#define  PEVE0    1
#define  PEOEP    0
#define PIFR	(*(volatile unsigned int *)0xb2)
#define  PEV2     3
#define  PEV1     2
#define  PEV0     1
#define  PEOP     0


/* L.I.N */
#define LINCR	(*(volatile unsigned char *)0xc8)
#define  LSWRES   7
#define  LIN13    6
#define  LCONF1   5
#define  LCONF0   4
#define  LENA     3
#define  LCMD2    2
#define  LCMD1    1
#define  LCMD0    0
#define LINSIR	(*(volatile unsigned char *)0xc9)
#define  LIDST2   7
#define  LIDST1   6
#define  LIDST0   5
#define  LBUSY    4
#define  LERR     3
#define  LIDOK    2
#define  LTXOK    1
#define  LRXOK    0
#define LINENIR	(*(volatile unsigned char *)0xca)
#define  LENERR   3
#define  LENIDOK  2
#define  LENTXOK  1
#define  LENRXOK  0
#define LINERR	(*(volatile unsigned char *)0xcb)
#define  LABORT   7
#define  LTOERR   6
#define  LOVERR   5
#define  LFERR    4
#define  LSERR    3
#define  LPERR    2
#define  LCERR    1
#define  LBERR    0
#define LINBTR	(*(volatile unsigned char *)0xcc)
#define  LDISR    7
#define LINBRR	(*(volatile unsigned char *)0xcd)
#define LINBRRL	(*(volatile unsigned char *)0xcd)
#define LINBRRH	(*(volatile unsigned char *)0xce)
#define LINDLR	(*(volatile unsigned char *)0xcf)
#define  LTXDL3   7
#define  LTXDL2   6
#define  LTXDL1   5
#define  LTXDL0   4
#define  LRXDL3   3
#define  LRXDL2   2
#define  LRXDL1   1
#define  LRXDL0   0
#define LINIDR	(*(volatile unsigned char *)0xd0)
#define  LP1      7
#define  LP0      6
#define  LDL1     5
#define  LDL0     4
#define  LID5     5
#define  LID4     4
#define  LID3     3
#define  LID2     2
#define  LID1     1
#define  LID0     0
#define LINSEL	(*(volatile unsigned char *)0xd1)
#define  LAINC    3
#define  LINDX2   2
#define  LINDX1   1
#define  LINDX0   0
#define LINDAT	(*(volatile unsigned char *)0xd2)


/* C.A.N */
#define CANGCON (*(volatile unsigned char *)0xd8)
#define  ABRQ     7
#define  OVRQ     6
#define  TTC      5
#define  SYNCTTC  4
#define  LISTEN   3
#define  TEST     2
#define  ENA      1
#define  SWRES    0
#define CANGSTA (*(volatile unsigned char *)0xd9)
#define  OVFG     6
#define  OVRG     6
#define  TXBSY    4
#define  RXBSY    3
#define  ENFG     2
#define  BOFF     1
#define  ERRP     0
#define CANGIT  (*(volatile unsigned char *)0xda)
#define  CANIT    7
#define  BOFFIT   6
#define  OVRTIM   5
#define  OVRBUF   4
#define  BXOK     4
#define  SERG     3
#define  CERG     2
#define  FERG     1
#define  AERG     0
#define  ERR_GEN_MSK 0x0f
#define  INT_GEN_MSK 0x5f
#define CANGIE  (*(volatile unsigned char *)0xdb)
#define  ENIT     7
#define  ENBOFF   6
#define  ENRX     5
#define  ENTX     4
#define  ENERMOB  3
#define  ENERR    3
#define  ENBUF    2
#define  ENBX     2
#define  ENERG    1
#define  ENOVRT   0
#define CANEN2  (*(volatile unsigned char *)0xdc)
#define CANEN1  (*(volatile unsigned char *)0xdd)
#define CANIE2  (*(volatile unsigned char *)0xde)
#define CANIE1  (*(volatile unsigned char *)0xdf)
#define CANSIT2 (*(volatile unsigned char *)0xe0)
#define CANSIT1 (*(volatile unsigned char *)0xe1)
#define CANBT1  (*(volatile unsigned char *)0xe2)
#define  BRP      1
#define  BRP_MSK  0x7e
#define CANBT2  (*(volatile unsigned char *)0xe3)
#define  SJW1     6
#define  SJW0     5
#define  SJW      5
#define  PRS2     3
#define  PRS1     2
#define  PRS0     1
#define  PRS      1
#define  SJW_MSK  0x60
#define  PRS_MSK  0x0e
#define CANBT3  (*(volatile unsigned char *)0xe4)
#define  PHS22    6
#define  PHS21    5
#define  PHS20    4
#define  PHS2     4
#define  PHS12    3
#define  PHS11    2
#define  PHS10    1
#define  PHS1     1
#define  SMP      0
#define  PHS2_MSK 0x70
#define  PHS1_MSK 0x0e
#define CANTCON (*(volatile unsigned char *)0xe5)
#define CANTIM  (*(volatile unsigned int *)0xe6)
#define CANTIML (*(volatile unsigned char *)0xe6)
#define CANTIMH (*(volatile unsigned char *)0xe7)
#define CANTTC  (*(volatile unsigned int *)0xe8)
#define CANTTCL (*(volatile unsigned char *)0xe8)
#define CANTTCH (*(volatile unsigned char *)0xe9)
#define CANTEC  (*(volatile unsigned char *)0xea)
#define CANREC  (*(volatile unsigned char *)0xeb)
#define CANHPMOB (*(volatile unsigned char *)0xec)
#define  HPMOB3   7
#define  HPMOB2   6
#define  HPMOB1   5
#define  HPMOB0   4
#define  HPMOB    4
#define  HPMOB_MSK 0xf0
#define  CGP3     3
#define  CGP2     2
#define  CGP1     1
#define  CGP0     0
#define  CGP      0
#define CANPAGE (*(volatile unsigned char *)0xed)
#define  MOBNB3   7
#define  MOBNB2   6
#define  MOBNB1   5
#define  MOBNB0   4
#define  MOBNB    4
#define  MOBNB_MSK 0xf0
#define  AINC     3
#define  INDX2    2
#define  INDX1    1
#define  INDX0    0
#define  INDX     0
#define  INDX_MSK 0x07
#define CANSTMOB (*(volatile unsigned char *)0xee)
#define  DLCW     7
#define  TXOK     6
#define  RXOK     5
#define  BERR     4
#define  SERR     3
#define  CERR     2
#define  FERR     1
#define  AERR     0
#define  ERR_MOB_MSK 0x1f
#define  INT_MOB_MSK 0x7f
#define CANCDMOB (*(volatile unsigned char *)0xef)
#define  CONMOB1  7
#define  CONMOB0  6
#define  CONMOB   6
#define  RPLV     5
#define  IDE      4
#define  DLC3     3
#define  DLC2     2
#define  DLC1     1
#define  DLC0     0
#define  DLC      0
#define  CONMOB_MSK 0xc0
#define  DLC_MSK    0x0f
#define CANIDT4 (*(volatile unsigned char *)0xf0)
#define  RTRTAG   2
#define  RB1TAG   1
#define  RB0TAG   0
#define CANIDT3 (*(volatile unsigned char *)0xf1)
#define CANIDT2 (*(volatile unsigned char *)0xf2)
#define CANIDT1 (*(volatile unsigned char *)0xf3)
#define CANIDM4 (*(volatile unsigned char *)0xf4)
#define  RTRMSK   2
#define  IDEMSK   0
#define CANIDM3 (*(volatile unsigned char *)0xf5)
#define CANIDM2 (*(volatile unsigned char *)0xf6)
#define CANIDM1 (*(volatile unsigned char *)0xf7)
#define CANSTM  (*(volatile unsigned int *)0xf8)
#define CANSTML (*(volatile unsigned char *)0xf8)
#define CANSTMH (*(volatile unsigned char *)0xf9)
#define CANMSG  (*(volatile unsigned char *)0xfa)

/*--------------------*/
/* Lock and Fuse Bits */
/*--------------------*/

/* lock bits */
#define  BLB12    5
#define  BLB11    4
#define  BLB02    3
#define  BLB01    2
#define  BLB      2
#define  LB2      1
#define  LB1      0
#define  LB       0

/* fuses extended bits */
#define  PSCRB     5
#define  PSCRVA    4
#define  PSCRVB    3
#define  BODLEVEL2 2
#define  BODLEVEL1 1
#define  BODLEVEL0 0
#define  BODLEVEL  0

