jwy8612/monitor/software/header/_iom32to64M1v.h
/* fuses high bits */
#define  RSTDISBL 7
#define  DWEN     6
#define  SPIEN    5
#define  WDTON    4
#define  EESAVE   3
#define  BOOTSZ1  2
#define  BOOTSZ0  1
#define  BOOTSZ   1
#define  BOOTRST  0

/* fuses low bits */
#define  CKDIV8   7
#define  CKOUT    6
#define  SUT1     5
#define  SUT0     4
#define  SUT      4
#define  CKSEL3   3
#define  CKSEL2   2
#define  CKSEL1   1
#define  CKSEL0   0
#define  CKSEL    0

/*--------------------------*/
/* Interrupt Vector Numbers */
/*--------------------------*/

#define iv_RESET        1
#define iv_ANA_COMP0    2
#define iv_ANA_COMP1    3
#define iv_ANA_COMP2    4
#define iv_ANA_COMP3    5
#define iv_PSC_FAULT    6
#define iv_PSC_EC       7
#define iv_INT0         8
#define iv_EXT_INT0     8
#define iv_INT1         9
#define iv_EXT_INT1     9
#define iv_INT2         10
#define iv_EXT_INT2     10
#define iv_INT3         11
#define iv_EXT_INT3     11
#define iv_TIM1_CAPT    12
#define iv_TIMER1_CAPT  12
#define iv_TIM1_COMPA   13
#define iv_TIMER1_COMPA 13
#define iv_TIM1_COMPB   14
#define iv_TIMER1_COMPB 14
#define iv_TIM1_OVF     15
#define iv_TIMER1_OVF   15
#define iv_TIM0_COMPA   16
#define iv_TIMER0_COMPA 16
#define iv_TIM0_COMPB   17
#define iv_TIMER0_COMPB 17
#define iv_TIM0_OVF     18
#define iv_TIMER0_OVF   18
#define iv_CAN_IT       19
#define iv_CANIT        19
#define iv_CAN          19
#define iv_CAN_TRANSFER 19
#define iv_CAN_INT      19
#define iv_CTIM_OVF     20
#define iv_OVRIT        20
#define iv_CAN_TIM_OVF  20
#define iv_CAN_TIM_OVR  20
#define iv_CAN_TOVF     20
#define iv_LIN_TC       21
#define iv_LIN_ERR      22
#define iv_PCINT0       23
#define iv_PCINT1       24
#define iv_PCINT2       25
#define iv_PCINT3       26
#define iv_SPI_STC      27
#define iv_ADC          28
#define iv_WDT          29
#define iv_EE_RDY       30
#define iv_EE_READY     30
#define iv_SPM_RDY      31
#define iv_SPM_READY    31

/*ja*/

#endif

